tests/fixtures/test_src/InformationRegisters/ктв_сб_События.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ктв_сб_События</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Момент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ктв_сб_События</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипИсточника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИсточник</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаВозникновения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ктв_сб_СобытияТочкиВозникновения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

tests/fixtures/test_src/InformationRegisters/ктв_сб_События/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбновитьИнформациюОбОбработкеСобытия", 0.3, Истина);
	
КонецПроцедуры //СписокПриАктивизацииСтроки()

&НаКлиенте
Процедура ОбновитьИнформациюОбОбработкеСобытия()
	
	ТочкаВозникновения = Неопределено;
	Ид = "";
	Ошибка = Ложь;
	ТекстОшибки = "";
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТочкаВозникновения = ТекущиеДанные.ТочкаВозникновения;
		Ид = ТекущиеДанные.Ид;
		Ошибка = ТекущиеДанные.Ошибка;
		ТекстОшибки = ТекущиеДанные.ТекстОшибки;
	КонецЕсли;
	
	ОбновитьИнформациюОбОбработкеСобытияСервер(ТочкаВозникновения, Ид);
	
	Элементы.ГруппаОбработкаОшибка.Видимость = Ошибка;
	
КонецПроцедуры //ОбновитьИнформациюОбОбработкеСобытия()

&НаСервере
Процедура ОбновитьИнформациюОбОбработкеСобытияСервер(ТочкаВозникновения, Ид)
	
	Обработка.Параметры.УстановитьЗначениеПараметра("ТочкаВозникновения", ТочкаВозникновения);
	Обработка.Параметры.УстановитьЗначениеПараметра("Ид"				, Ид);
	
	ОбработкаКлиент.Параметры.УстановитьЗначениеПараметра("ТочкаВозникновения"	, ТочкаВозникновения);
	ОбработкаКлиент.Параметры.УстановитьЗначениеПараметра("Ид"					, Ид);
	
КонецПроцедуры //ОбновитьИнформациюОбОбработкеСобытияСервер()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекДатаУ = ТекущаяУниверсальнаяДата();
	ТекДата = МестноеВремя(ТекДатаУ, ЧасовойПоясСеанса());
	
	СмещениеВремени = Цел((ТекДата - ТекДатаУ) / 60);
	
	Список.Параметры.УстановитьЗначениеПараметра("СмещениеВремени", СмещениеВремени);

	Обработка.Параметры.УстановитьЗначениеПараметра("ТочкаВозникновения", Справочники.ктв_сб_СобытияТочкиВозникновения.ЭтаИБ);
	Обработка.Параметры.УстановитьЗначениеПараметра("Ид"				, "");
	
	ОбработкаКлиент.Параметры.УстановитьЗначениеПараметра("ТочкаВозникновения"	, Справочники.ктв_сб_СобытияТочкиВозникновения.ЭтаИБ);
	ОбработкаКлиент.Параметры.УстановитьЗначениеПараметра("Ид"					, "");
	
КонецПроцедуры //ПриСозданииНаСервере()
